---
kind: property
id: P:Autodesk.Revit.DB.FamilyThermalProperties.VisualLightTransmittance
source: html/5ac42661-00c3-2c66-8a1d-0db1a1731217.htm
---
# Autodesk.Revit.DB.FamilyThermalProperties.VisualLightTransmittance Property

The visual light transmittance.

## Syntax (C#)
```csharp
public double VisualLightTransmittance { get; }
```